# Deliverables:

- Submit a single zip-compressed file that has the name: YourLastName_Exercise_5 that has the following files:

 1. Your **PDF document** that has your Source code and output
 2. Your **ipynb script** that has your Source code and output


# Objectives:

In this exercise, you will:

 - Construct hierarchical indexes
 - Select and group data to create pivot-tables




# Submission Formats :

Create a folder or directory with all supplementary files with your last name at the beginning of the folder name, compress that folder with zip compression, and post the zip-archived folder under the assignment link in Canvas. The following files should be included in an archive folder/directory that is uploaded as a single zip-compressed file. (Use zip, not StuffIt or any 7z or any other compression method.)


1. Complete IPYNB script that has the source code in Python used to access and analyze the data. The code should be submitted as an IPYNB script that can be be loaded and run in Jupyter Notebook for Python
2. Output from the program, such as console listing/logs, text files, and graphics output for visualizations. If you use the Data Science Computing Cluster or School of Professional Studies database servers or systems, include Linux logs of your sessions as plain text files. Linux logs may be generated by using the script process at the beginning of your session, as demonstrated in tutorial handouts for the DSCC servers.
3. List file names and descriptions of files in the zip-compressed folder/directory.


Formatting Python Code
When programming in Python, refer to Kenneth Reitzâ€™ PEP 8: The Style Guide for Python Code:
http://pep8.org/ (Links to an external site.)Links to an external site.
There is the Google style guide for Python at
https://google.github.io/styleguide/pyguide.html (Links to an external site.)Links to an external site.
Comment often and in detail.

# Specifications and Requirements


We're going to use the XYZ data again  to construct hierarchical indexes and select, modify, group, and reshape data in a wide variety of ways.  The data we want here, which we'll call xyzcustnew, are as follows:

In [1]:
import pandas as pd  # panda's nickname is pd
import numpy as np  # numpy as np
from pandas import DataFrame, Series, Categorical 
from sqlalchemy import create_engine

In [2]:
engine=create_engine('sqlite:///xyz.db')	    # the db is in my current working directory

In [3]:
xyzcustnew=pd.read_sql_table('xyzcust',engine)
xyzcustnew.head()

,index,ACCTNO,ZIP,ZIP4,LTD_SALES,LTD_TRANSACTIONS,YTD_SALES_2009,YTD_TRANSACTIONS_2009,CHANNEL_ACQUISITION,BUYER_STATUS,ZIP9_SUPERCODE
0,0,WDQQLLDQL,60084,5016,90.0,1,0.0,0,IB,INACTIVE,600845016
1,1,WQWAYHYLA,60091,1750,4227.0,9,1263.0,3,RT,ACTIVE,600911750
2,2,GSHAPLHAW,60067,900,420.0,3,129.0,1,RT,ACTIVE,600670900
3,3,PGGYDYWAD,60068,3838,6552.0,6,0.0,0,RT,INACTIVE,600683838
4,4,LWPSGPLLS,60090,3932,189.0,3,72.0,1,RT,ACTIVE,600903932

In [4]:
print((xyzcustnew.YTD_SALES_2009[xyzcustnew.BUYER_STATUS=="INACTIVE"]>0).sum())
print((xyzcustnew.YTD_SALES_2009[xyzcustnew.BUYER_STATUS=="LAPSED"]>0).sum())
xyzcustnew.BUYER_STATUS.unique()

0
0

array(['INACTIVE', 'ACTIVE', 'LAPSED'], dtype=object)

In [5]:
# Lets define a cutoff value for what we will consider to be the heavy customers 

heavyCut = xyzcustnew.YTD_SALES_2009[xyzcustnew.BUYER_STATUS=="ACTIVE"].quantile(0.67)
heavyCut

423.0

[heavyCat is just an array of cat values 1s and 0s not cat var yet.]

In [6]:
heavyCat=Categorical(np.where(xyzcustnew.YTD_SALES_2009>heavyCut,1,0))
heavyCat.describe()

            counts     freqs
categories
0            25795  0.854733
1             4384  0.145267

In [7]:
heavyCat

[0, 1, 0, 0, 0, ..., 0, 0, 0, 0, 1]
Length: 30179
Categories (2, int64): [0, 1]

[same array just renamed w pandas.Series.cat.rename_categories]

In [8]:
heavyCat.rename_categories(['regular','heavy'],inplace=True)
heavyCat

[regular, heavy, regular, regular, regular, ..., regular, regular, regular, regular, heavy]
Length: 30179
Categories (2, object): [regular, heavy]

In [9]:
heavyCat.describe()

            counts     freqs
categories
regular      25795  0.854733
heavy         4384  0.145267

In [10]:
heavyCat[:10]

[regular, heavy, regular, regular, regular, regular, heavy, regular, regular, regular]
Categories (2, object): [regular, heavy]

[adding heavyCat to xyzcustnew]

In [11]:
xyzcustnew['heavyCat']=heavyCat

[making dummy = cat var out of cat val which are actually strings

In [12]:
buyerType=pd.get_dummies(heavyCat)
print(type(buyerType), buyerType.shape)

<class 'pandas.core.frame.DataFrame'> (30179, 2)

[this is the cat var]

In [13]:
buyerType[:3]

   regular  heavy
0        1      0
1        0      1
2        1      0

[moving the cat over to xyzcustnew]

In [14]:
xyzcustnew['typeReg']=buyerType['regular']
xyzcustnew['typeHeavy']=buyerType['heavy']

[so there is col of regular, heavy labels next to 2 cat var]

In [15]:
xyzcustnew.columns

Index(['index', 'ACCTNO', 'ZIP', 'ZIP4', 'LTD_SALES', 'LTD_TRANSACTIONS',
       'YTD_SALES_2009', 'YTD_TRANSACTIONS_2009', 'CHANNEL_ACQUISITION',
       'BUYER_STATUS', 'ZIP9_SUPERCODE', 'heavyCat', 'typeReg', 'typeHeavy'],
      dtype='object')

[moving from cust db to trans db 
getting date and 3 date components
as pandas.core.series.Series
then swapping letters for numbers
and from numbers to a pandas datatime series]

In [16]:

xyztrans=pd.read_sql('xyztrans', engine)

trandate=xyztrans.TRANDATE	# should be a Series

daystr=trandate.str[0:2]		# two digit date numbers slice

mostr=trandate.str[2:5]		# the three letter month abbreviations

yearstr=trandate.str[5:]		# four digit years

In [17]:
type(mostr)

pandas.core.series.Series

In [18]:
#create a dictionary for the months
monums={'JAN':'1', 'FEB':'2', 'MAR':'3', 'APR':'4', 'MAY':'5', 'JUN':'6', 'JUL':'7', 'AUG':'8', 'SEP':'9', 'OCT':'10', 'NOV':'11','DEC':'12'}
#month
monos=mostr.map(monums)	# do a dict lookup for each value of mostr

transtr=yearstr+'-'+monos+'-'+daystr
type(transtr)

pandas.core.series.Series

transtr should be a Series.  Now let's convert the string values in transtr into datetime values:

In [19]:
trDateTime=pd.to_datetime(transtr)
type(trDateTime)

pandas.core.series.Series

[.value_counts()
count the number of times each date is mentioned in the series
returns series sorted desc by count]

In [20]:
trCounts=trDateTime.value_counts()
trCounts

2009-12-19    877
2009-12-21    836
2009-12-12    782
2009-12-23    765
2009-12-20    744
2009-12-22    717
2009-12-18    708
2009-12-14    615
2009-12-15    599
2009-12-16    571
2009-12-11    568
2009-11-21    561
2009-12-13    542
2009-11-22    507
2009-12-10    504
2009-12-04    488
2009-11-25    451
2009-12-24    425
2009-11-23    421
2009-11-27    419
2009-11-24    412
2009-04-10    404
2009-11-28    402
2009-11-14    402
2009-12-09    401
2009-05-09    398
2009-12-08    397
2009-11-07    394
2009-12-07    372
2009-01-17    372
             ...
2009-02-26     47
2009-04-30     47
2009-02-21     39
2009-03-01     36
2009-03-10     33
2009-06-14     29
2009-11-26     26
2009-03-16     24
2009-07-14     24
2009-06-15     24
2009-08-30     23
2009-11-04     23
2009-02-25     22
2009-02-02     22
2009-10-17     21
2009-03-08     20
2009-03-27     19
2009-02-03     19
2009-02-01     18
2009-03-11     17
2009-02-07     16
2009-07-02     15
2009-06-13     14
2009-07-16     14
2009-12-25     11
2009-08-15     11
2009-04-12     10
2009-10-13     10
2009-08-21      6
2009-03-15      5
Name: TRANDATE, Length: 365, dtype: int64


The order of the counts in trDateTime is not chronological, so let's reorder them so that they go from earliest to most recent date.

[get index from trCount which is a series of dates, take their min and max and use that to set the min and max of a new index. reindex keeps association between counts and dates as it reindexes the date index puts into trCountsChrono.  i have to think there's a better shorter way.]

In [21]:
newIndex=pd.date_range(trCounts.index.min(),trCounts.index.max())

trCountsChrono=trCounts.reindex(index=newIndex)
newIndex

DatetimeIndex(['2009-01-01', '2009-01-02', '2009-01-03', '2009-01-04',
               '2009-01-05', '2009-01-06', '2009-01-07', '2009-01-08',
               '2009-01-09', '2009-01-10',
               ...
               '2009-12-22', '2009-12-23', '2009-12-24', '2009-12-25',
               '2009-12-26', '2009-12-27', '2009-12-28', '2009-12-29',
               '2009-12-30', '2009-12-31'],
              dtype='datetime64[ns]', length=365, freq='D')

In [22]:
print(trCountsChrono.head())

2009-01-01    176
2009-01-02    305
2009-01-03    365
2009-01-04    231
2009-01-05    144
Freq: D, Name: TRANDATE, dtype: int64

[been using indexes. now multi indexes that allow 2+ dim into 2 dim view because allows to stack and move dim around.]

One of the very handy things you can do with pandas DataFrames and Series is that you can create what are called hierarchical indexes.  These are multi-level indexes (the are in fact called MultiIndexes).  They make it easier to select, modify, group, and reshape data in a wide variety of ways.  They make it possible to work with high dimensional data in data structures that are in just one or two dimensions.

Let's change trCountsChrono a bit to produce a first simple example of a Series with a hierarchical index.  First, let's put the Series into a DataFrame and then rename the columns:

In [23]:
trDF=DataFrame()

In [24]:
trDF['date'] = trCountsChrono.index
trDF['transactions'] = trCountsChrono.values

In [25]:
trDF.columns

Index(['date', 'transactions'], dtype='object')

In [26]:
trDF.head()

        date  transactions
0 2009-01-01           176
1 2009-01-02           305
2 2009-01-03           365
3 2009-01-04           231
4 2009-01-05           144

Note that the data types of the columns have not changed.  Try trDF.dtypes.

Now, let's create a new column that indicates whether the number of daily transactions are heavy or light depending on whether the are equal to or greater than the median number of transactions, or less than the median number.  There are more succinct ways to do this, but this is transparent, if not efficient:

In [27]:
trDF.dtypes

date            datetime64[ns]
transactions             int64
dtype: object

In [28]:
trMed=trDF.transactions.median()		# here's the median

[ heavyLight is just a function not acting on an object yet. 
thus we dont know where heavy or light are and dont know source of x. 
breaking this down is cool: the parameter is 
greater than trMed and 
it is either heavy or light
i think and is executed before or
so it is >= trMed and heavy setting it to heavy
or it is light setting it to light.
as in it wouldnt have worked if you said >=trMed or light and heavy.
if we did that it would simply evaluate is x heavy and light FALSE or is it >= trMed TRUE or light]

In [29]:
heavyLight=lambda x  : x >= trMed and 'heavy' or 'light'  # an example anon function

[then we apply it.]

In [30]:
trDF.head(4)

        date  transactions
0 2009-01-01           176
1 2009-01-02           305
2 2009-01-03           365
3 2009-01-04           231

In [31]:
trDF['vol']=trDF.transactions.map(heavyLight)	# 'vol' is the heavy/light column

In [32]:
trDF.head(4)

        date  transactions    vol
0 2009-01-01           176  heavy
1 2009-01-02           305  heavy
2 2009-01-03           365  heavy
3 2009-01-04           231  heavy

Note that this lambda would stumble if trMed wasn't known at the time lambda was called by the map method.

Anyway, next we're going to create, monum, a variable indicating the month of the calendar year that each day falls into:

In [33]:
trDF['monum']=trDF.date.dt.month	# .dt is the datetime accessor
trDF.head(4)

        date  transactions    vol  monum
0 2009-01-01           176  heavy      1
1 2009-01-02           305  heavy      1
2 2009-01-03           365  heavy      1
3 2009-01-04           231  heavy      1

Next, we're going to collapse the daily transaction counts into monthly counts.  When we do this we'll keep the heavy versus light daily volume distinction.  First we're going to drop the 'date' column because we no longer need it.  To be safe we'll copy the result to a new DataFrame just in case something goes wrong:

In [34]:
trDFnd=trDF.drop('date',axis=1)	# axis=1 means here a column is selected to drop

In [35]:
trDFnd.head(4)

   transactions    vol  monum
0           176  heavy      1
1           305  heavy      1
2           365  heavy      1
3           231  heavy      1

Now using this DataFrame's groupby() method,  sum up the transactions within month by heavy volume days and light volume days:
[remember groupby returns nothing until an aggregator like sum is attached.]

In [36]:
trDFgrouped=trDFnd.groupby(['vol','monum']).sum()
trDFgrouped

             transactions
vol   monum
heavy 1              5255
      2               761
      3              1130
      4              2327
      5              2172
      6              2878
      7              4440
      8              1682
      9              1921
      10             2109
      11             8402
      12            13168
light 1               572
      2              1625
      3              1664
      4              1727
      5              2076
      6              1495
      7               564
      8              1938
      9              1942
      10             2241
      11               49
      12              257

In [37]:
trDFgrouped=trDFnd.groupby(['monum','vol']).sum()
trDFgrouped

             transactions
monum vol
1     heavy          5255
      light           572
2     heavy           761
      light          1625
3     heavy          1130
      light          1664
4     heavy          2327
      light          1727
5     heavy          2172
      light          2076
6     heavy          2878
      light          1495
7     heavy          4440
      light           564
8     heavy          1682
      light          1938
9     heavy          1921
      light          1942
10    heavy          2109
      light          2241
11    heavy          8402
      light            49
12    heavy         13168
      light           257

[structure in index.levels this gives the uniuqes and the next gives the series
notice the codes are zero for the label jan which occupies the first 2 rows of trDFgrouped
followed by 2 febs which are coded 1]

In [38]:
trDFgrouped.index.levels

FrozenList([[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12], ['heavy', 'light']])

In [39]:
trDFgrouped.index

MultiIndex(levels=[[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12], ['heavy', 'light']],
           codes=[[0, 0, 1, 1, 2, 2, 3, 3, 4, 4, 5, 5, 6, 6, 7, 7, 8, 8, 9, 9, 10, 10, 11, 11], [0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1]],
           names=['monum', 'vol'])

In [40]:
trDFgrouped.head(4)

             transactions
monum vol
1     heavy          5255
      light           572
2     heavy           761
      light          1625

Now if you look at this DataFrame you'll see that it has two levels of indexing, monum, and within the levels of monum, vol.   If you enter trDFgrouped.index you'll get back a MultiIndex object.  Also, try trDFgrouped.index.levels to see what you get.
 
pandas has pretty seamlessly created this index for you, but you can construct MultiIndexes manually by combining equal length arrays (using MultiIndex.from_arrays) of index levels, or by using tuples (with MultiIndex.from_tuples).  In both cases all combinations of the levels need to be included.  Or, you can use MultiIndex.from_product to get a cross set of the values of iterables.   

Note that if you look at trDFgrouped you may see here and there that for a particular month, the number of heavy day transactions is less than the number of light day transactions.  How do you think that could happen?
[thats how we set up the lambda function to label]

You can use MultiIndexes to select and subset DataFrames and Series in many of the same ways you can use simple indexes.  For example, to get the heavy days transaction count data for November, you can do:

[slicing is by index and this is slicing by a multiindex]

In [41]:
trDFgrouped.loc[11,'heavy']

transactions    8402
Name: (11, heavy), dtype: int64

The first six months of data:
[range returns first to last-1]

In [42]:

trDFgrouped.loc[list(range(1,7))]

             transactions
monum vol
1     heavy          5255
      light           572
2     heavy           761
      light          1625
3     heavy          1130
      light          1664
4     heavy          2327
      light          1727
5     heavy          2172
      light          2076
6     heavy          2878
      light          1495

or the first 6 rows of data:

In [43]:
trDFgrouped.iloc[0:6]		# .iloc here, but .loc above.

             transactions
monum vol
1     heavy          5255
      light           572
2     heavy           761
      light          1625
3     heavy          1130
      light          1664

The data starting from the March heavy day counts to the July light counts: [march light to july heavy]

In [44]:
trDFgrouped[(3,'light'):(7,'heavy')]

             transactions
monum vol
3     light          1664
4     heavy          2327
      light          1727
5     heavy          2172
      light          2076
6     heavy          2878
      light          1495
7     heavy          4440

The above uses a range defined by a slice of tuples.  So does:

In [45]:
trDFgrouped[(3,'light'):6]

             transactions
monum vol
3     light          1664
4     heavy          2327
      light          1727
5     heavy          2172
      light          2076
6     heavy          2878
      light          1495

Try selecting some data and slicing a few times yourself.  It takes a little practice to get the hang of getting what you want.

There are many other ways to slice using MultiIndexes.  One other you might find interesting is the cross-section method .xs. Here's an example that picks out data for the light days:

[***********]

In [46]:
trDFgrouped.xs('light',level='vol')

       transactions
monum
1               572
2              1625
3              1664
4              1727
5              2076
6              1495
7               564
8              1938
9              1942
10             2241
11               49
12              257

As you probably know, DataFrames have a transpose method, .T:

In [47]:
trDFgrouped.xs('light',level='vol').T		# the transpose of the above

monum,1,2,3,4,5,6,7,8,9,10,11,12
transactions,572,1625,1664,1727,2076,1495,564,1938,1942,2241,49,257

Did you get a table of transactions with cells labeled by monum across the top?

You can also pivot DataFrames in various ways.  Let's make some data to create a DataFrame we can pivot.  We'll put the monum and vol indexes from trDFgrouped into our new DataFrame as columns, and then we'll add transactions as a third column.

[remember monum and vol are index 0 and index 1 in DF where values transactions are values.  so the next 2 are index 0 and 1 from untransposed df and remain indexes.]

In [48]:
mo=trDFgrouped.index.get_level_values(0) 	# the month numbers
mo

Int64Index([1, 1, 2, 2, 3, 3, 4, 4, 5, 5, 6, 6, 7, 7, 8, 8, 9, 9, 10, 10, 11,
            11, 12, 12],
           dtype='int64', name='monum')

In [49]:
volType=trDFgrouped.index.get_level_values(1)	# vol
volType

Index(['heavy', 'light', 'heavy', 'light', 'heavy', 'light', 'heavy', 'light',
       'heavy', 'light', 'heavy', 'light', 'heavy', 'light', 'heavy', 'light',
       'heavy', 'light', 'heavy', 'light', 'heavy', 'light', 'heavy', 'light'],
      dtype='object', name='vol')

[make a new DF:notice that trDFgrouped already has month and volume in its index. watch those disappear.]

In [50]:
trDFpiv=DataFrame({'month':mo,'vol': volType, 'transactions':trDFgrouped.transactions})		# data as a dict
trDFpiv.head(4)

             month    vol  transactions
monum vol
1     heavy      1  heavy          5255
      light      1  light           572
2     heavy      2  heavy           761
      light      2  light          1625

Now, let's pivot trDFpiv.  Let's make a new DataFrame with month as the index, vol the columns, and the transaction counts as the values: [the pivot is created on the old DF and then saved to new.]

In [51]:
trDFpived=trDFpiv.pivot(index='month',columns='vol',values='transactions')
trDFpived

vol    heavy  light
month
1       5255    572
2        761   1625
3       1130   1664
4       2327   1727
5       2172   2076
6       2878   1495
7       4440    564
8       1682   1938
9       1921   1942
10      2109   2241
11      8402     49
12     13168    257

[looks the same as this one that i made.]

In [52]:
trDFgrouped.unstack()

      transactions
vol          heavy light
monum
1             5255   572
2              761  1625
3             1130  1664
4             2327  1727
5             2172  2076
6             2878  1495
7             4440   564
8             1682  1938
9             1921  1942
10            2109  2241
11            8402    49
12           13168   257

How does trDFpived look to you?

If trDFpiv had more than one column for values not used as a column or an index, hierarchical columns would be created to reflect them.  For example, let's add an additional column to trDFpiv:

In [53]:
trDFpiv['randy']=np.random.randn(len(trDFpiv))

Now pivot trDFpiv like:
[notice that it creates 2 new cols because the len of trDFpiv is 24 not 12; not exactly sure how it arrives at heavy light for random. i think it is heavy light for month and then those just go in month theyare assigned.]

In [54]:
len(trDFpiv)

24

In [55]:
trDFpived2=trDFpiv.pivot(index='month',columns='vol')
trDFpived2

      transactions           randy
vol          heavy light     heavy     light
month
1             5255   572 -1.067219  1.034217
2              761  1625  0.209018 -0.023390
3             1130  1664  0.487063  0.743045
4             2327  1727 -0.222495  0.218071
5             2172  2076  0.659444  1.174523
6             2878  1495 -0.223234  0.374025
7             4440   564  1.610295 -0.129922
8             1682  1938 -0.812025 -0.031330
9             1921  1942 -0.997889  1.440815
10            2109  2241 -1.151826 -0.127521
11            8402    49 -0.423529  0.490692
12           13168   257  1.255319  0.635785

How does trDFpived2 look? 

OK, let's drop randy from trDFpiv and try some other things. 

Feeling lucky?  Then do trDFpiv.drop('randy',axis=1,inplace=True).

You can also stack and unstack DataFrames.  These methods come in handy when you need to shape some data in a particular way to be input to an algorithm.  Let's aggregate some of the xyzcustnew data (see above) to get a DataFrame we can stack and unstack:

In [56]:
trDFpiv.drop('randy',axis=1,inplace=True)
trDFpiv

             month    vol  transactions
monum vol
1     heavy      1  heavy          5255
      light      1  light           572
2     heavy      2  heavy           761
      light      2  light          1625
3     heavy      3  heavy          1130
      light      3  light          1664
4     heavy      4  heavy          2327
      light      4  light          1727
5     heavy      5  heavy          2172
      light      5  light          2076
6     heavy      6  heavy          2878
      light      6  light          1495
7     heavy      7  heavy          4440
      light      7  light           564
8     heavy      8  heavy          1682
      light      8  light          1938
9     heavy      9  heavy          1921
      light      9  light          1942
10    heavy     10  heavy          2109
      light     10  light          2241
11    heavy     11  heavy          8402
      light     11  light            49
12    heavy     12  heavy         13168
      light     12  light           257

[intersting the randy stays in trDFpived2
because hes made the above change inplace=True]

In [58]:
trDFpived2

      transactions           randy
vol          heavy light     heavy     light
month
1             5255   572 -1.067219  1.034217
2              761  1625  0.209018 -0.023390
3             1130  1664  0.487063  0.743045
4             2327  1727 -0.222495  0.218071
5             2172  2076  0.659444  1.174523
6             2878  1495 -0.223234  0.374025
7             4440   564  1.610295 -0.129922
8             1682  1938 -0.812025 -0.031330
9             1921  1942 -0.997889  1.440815
10            2109  2241 -1.151826 -0.127521
11            8402    49 -0.423529  0.490692
12           13168   257  1.255319  0.635785

In [59]:
xyzdata=xyzcustnew[['BUYER_STATUS','heavyCat','CHANNEL_ACQUISITION']]
xyzdata.head()

  BUYER_STATUS heavyCat CHANNEL_ACQUISITION
0     INACTIVE  regular                  IB
1       ACTIVE    heavy                  RT
2       ACTIVE  regular                  RT
3     INACTIVE  regular                  RT
4       ACTIVE  regular                  RT

Use xyzdata because it's just easier.  It has just the three columns we're now going to work with.
[just remember groupby has no output until acted on.]

[IT MOVES LEFT TO RIGHT: BUYER STATUS ON OUTSIDE HIGHEST IN HIERARCHY OF INDEX AND THEN HEAVYCAT MIDDLE INDEX HIERARCHY LEVEL AND THEN CHANNEL ON RHS IN HIERARCHY***** WHEN UNSTACKED THE INSIDE LOWEST GOES TO COLS and if unstacked again then inside index goes to columns and is lowest coclumn level hierarchy.]

In [60]:
xyzgrouped=xyzdata.groupby(['BUYER_STATUS','heavyCat','CHANNEL_ACQUISITION'])
xyzgrouped

In [61]:
xyzCountData = xyzgrouped.size()	# a MultiIndexed Series of counts [ sum and count do nothing here.******]
xyzCountData

BUYER_STATUS  heavyCat  CHANNEL_ACQUISITION
ACTIVE        regular   CB                      443
                        IB                     1112
                        RT                     7393
              heavy     CB                      356
                        IB                      703
                        RT                     3325
INACTIVE      regular   CB                      691
                        IB                     1249
                        RT                     7056
LAPSED        regular   CB                      372
                        IB                     1111
                        RT                     6368
dtype: int64

In [62]:
print(type(xyzCountData.unstack()))
print(xyzCountData.unstack())
xyzCountData.unstack().unstack()

<class 'pandas.core.frame.DataFrame'>
CHANNEL_ACQUISITION     CB    IB    RT
BUYER_STATUS heavyCat
ACTIVE       regular   443  1112  7393
             heavy     356   703  3325
INACTIVE     regular   691  1249  7056
LAPSED       regular   372  1111  6368

CHANNEL_ACQUISITION      CB             IB             RT
heavyCat            regular  heavy regular  heavy regular   heavy
BUYER_STATUS
ACTIVE                443.0  356.0  1112.0  703.0  7393.0  3325.0
INACTIVE              691.0    NaN  1249.0    NaN  7056.0     NaN
LAPSED                372.0    NaN  1111.0    NaN  6368.0     NaN

xyzCountData is a Series with a MultiIndex, and so it can be unstacked, changing it from tall and narrow to short and wide.  Note that by default, only the lowest level of the MultiIndex is used for unstacking.  Do you know why there are no heavy buyers in the INACTIVE or LAPSED categories?

[because when we set up heavycat, we set it up with print((xyzcustnew.YTD_SALES_2009[xyzcustnew.BUYER_STATUS=="ACTIVE"]>0).sum())
and 
print((xyzcustnew.YTD_SALES_2009[xyzcustnew.BUYER_STATUS=="INACTIVE"]>0).sum()) ---> 0
print((xyzcustnew.YTD_SALES_2009[xyzcustnew.BUYER_STATUS=="LAPSED"]>0).sum())   ---> 0


Let's â€œrestackâ€ this into a different version of xyzCountData:

In [63]:
unStackxyz=xyzCountData.unstack()		# what we had just above

In [64]:
unStackxyz.T.stack()		# .T is the transpose

BUYER_STATUS                  ACTIVE  INACTIVE  LAPSED
CHANNEL_ACQUISITION heavyCat
CB                  regular      443     691.0   372.0
                    heavy        356       NaN     NaN
IB                  regular     1112    1249.0  1111.0
                    heavy        703       NaN     NaN
RT                  regular     7393    7056.0  6368.0
                    heavy       3325       NaN     NaN

Note how in the above, combinations of the levels of the three variables that do not actually occur in the data are given an NaN, a missing value.  NaN means â€œnot a number.â€  The cells are stacked using levels of BUYER_STATUS within levels of CHANNEL_ACQUISITION.

Try doing unStackxyz.T.stack(1) to get stacking by heavyCat instead of by BUYER_STATUS. Here again, cells do not have observations are given a NaN.

The unstack method can return a stacked object as it was when it was stacked, but it can also return it in a different unstacked form.  For example, see what this does:


unStackxyz.T --> stack or stack(1) will bring lower col to inner row, stack(0) brings upper col into inner row
unStackxyz.T.unstack() --> col into outer row
so stack seems to demote from col to inner row and unstack seems to demote from upper col to outer row but not really haha
unStackxyz.T.stack(1).unstack() does transpose so weird

In [65]:
unStackxyz.T.stack(0).unstack(1)

heavyCat            regular                   heavy
BUYER_STATUS         ACTIVE INACTIVE LAPSED  ACTIVE INACTIVE LAPSED
CHANNEL_ACQUISITION
CB                      443      691    372   356.0      NaN    NaN
IB                     1112     1249   1111   703.0      NaN    NaN
RT                     7393     7056   6368  3325.0      NaN    NaN

You can stack or unstack on multiple levels at one time.  See what this does for you:

In [66]:
unStackxyz.T.stack(level=['heavyCat','BUYER_STATUS'])

CHANNEL_ACQUISITION  heavyCat  BUYER_STATUS
CB                   regular   ACTIVE           443.0
                               INACTIVE         691.0
                               LAPSED           372.0
                     heavy     ACTIVE           356.0
IB                   regular   ACTIVE          1112.0
                               INACTIVE        1249.0
                               LAPSED          1111.0
                     heavy     ACTIVE           703.0
RT                   regular   ACTIVE          7393.0
                               INACTIVE        7056.0
                               LAPSED          6368.0
                     heavy     ACTIVE          3325.0
dtype: float64

and compare to:

In [67]:
unStackxyz.T.stack(level=['BUYER_STATUS','heavyCat'])

CHANNEL_ACQUISITION  BUYER_STATUS  heavyCat
CB                   ACTIVE        regular      443.0
                                   heavy        356.0
                     INACTIVE      regular      691.0
                     LAPSED        regular      372.0
IB                   ACTIVE        regular     1112.0
                                   heavy        703.0
                     INACTIVE      regular     1249.0
                     LAPSED        regular     1111.0
RT                   ACTIVE        regular     7393.0
                                   heavy       3325.0
                     INACTIVE      regular     7056.0
                     LAPSED        regular     6368.0
dtype: float64

The pandas melt() method provides some similar functionality.  You can use it to turn a short and wide DataFrame into a taller, narrower one by identifying columns that contain values to be used as record identifiers.   Let's go back to the xyzcustnew data and select a few columns from it to do some melting on:

[melt kind of makes a DB look to the previously hierarchical df]

In [68]:
xyzcust=xyzcustnew[['BUYER_STATUS','heavyCat','LTD_SALES']].copy()
xyzcust.head(4)

  BUYER_STATUS heavyCat  LTD_SALES
0     INACTIVE  regular       90.0
1       ACTIVE    heavy     4227.0
2       ACTIVE  regular      420.0
3     INACTIVE  regular     6552.0

Now, let's melt xyzcust so that BUYER_STATUS and heavyCat become identifiers:

In [69]:
xyzcustm=pd.melt(xyzcust,id_vars=['BUYER_STATUS','heavyCat'],var_name="LTD_SALES")

xyzcustm will look something like:

In [70]:
print(xyzcustm)

      BUYER_STATUS heavyCat  LTD_SALES   value
0         INACTIVE  regular  LTD_SALES    90.0
1           ACTIVE    heavy  LTD_SALES  4227.0
2           ACTIVE  regular  LTD_SALES   420.0
3         INACTIVE  regular  LTD_SALES  6552.0
4           ACTIVE  regular  LTD_SALES   189.0
5           ACTIVE  regular  LTD_SALES  4278.0
6           ACTIVE    heavy  LTD_SALES  1869.0
7           ACTIVE  regular  LTD_SALES    33.0
8         INACTIVE  regular  LTD_SALES   735.0
9         INACTIVE  regular  LTD_SALES   468.0
10          ACTIVE  regular  LTD_SALES   804.0
11          LAPSED  regular  LTD_SALES   219.0
12          ACTIVE    heavy  LTD_SALES  3240.0
13        INACTIVE  regular  LTD_SALES   180.0
14          ACTIVE  regular  LTD_SALES   423.0
15        INACTIVE  regular  LTD_SALES   306.0
16          LAPSED  regular  LTD_SALES  1002.0
17          ACTIVE  regular  LTD_SALES  1155.0
18          ACTIVE  regular  LTD_SALES   612.0
19          ACTIVE  regular  LTD_SALES   633.0
20        INACTIVE  regular  LTD_SALES   114.0
21          ACTIVE  regular  LTD_SALES   294.0
22        INACTIVE  regular  LTD_SALES   849.0
23        INACTIVE  regular  LTD_SALES    72.0
24          ACTIVE    heavy  LTD_SALES  3411.0
25          ACTIVE    heavy  LTD_SALES  1023.0
26          LAPSED  regular  LTD_SALES   873.0
27          ACTIVE    heavy  LTD_SALES  2778.0
28          ACTIVE    heavy  LTD_SALES  2676.0
29          LAPSED  regular  LTD_SALES   528.0
...            ...      ...        ...     ...
30149       ACTIVE  regular  LTD_SALES   861.0
30150       ACTIVE  regular  LTD_SALES   837.0
30151       ACTIVE  regular  LTD_SALES  2478.0
30152       ACTIVE  regular  LTD_SALES    84.0
30153       ACTIVE    heavy  LTD_SALES  2877.0
30154     INACTIVE  regular  LTD_SALES  1611.0
30155       LAPSED  regular  LTD_SALES  1860.0
30156       LAPSED  regular  LTD_SALES    48.0
30157       ACTIVE  regular  LTD_SALES   195.0
30158       LAPSED  regular  LTD_SALES    60.0
30159     INACTIVE  regular  LTD_SALES   252.0
30160       LAPSED  regular  LTD_SALES   594.0
30161       LAPSED  regular  LTD_SALES  1272.0
30162       ACTIVE    heavy  LTD_SALES  2184.0
30163       ACTIVE  regular  LTD_SALES   759.0
30164     INACTIVE  regular  LTD_SALES   756.0
30165       ACTIVE  regular  LTD_SALES  1365.0
30166       ACTIVE    heavy  LTD_SALES  2490.0
30167       ACTIVE    heavy  LTD_SALES   438.0
30168     INACTIVE  regular  LTD_SALES   549.0
30169       ACTIVE  regular  LTD_SALES   150.0
30170       ACTIVE  regular  LTD_SALES    93.0
30171     INACTIVE  regular  LTD_SALES   834.0
30172     INACTIVE  regular  LTD_SALES   147.0
30173       LAPSED  regular  LTD_SALES   816.0
30174       ACTIVE  regular  LTD_SALES  2736.0
30175       ACTIVE  regular  LTD_SALES  2412.0
30176     INACTIVE  regular  LTD_SALES   429.0
30177     INACTIVE  regular  LTD_SALES   651.0
30178       ACTIVE    heavy  LTD_SALES  4527.0

[30179 rows x 4 columns]

You'll probably realize that the leftmost column is a simple numerical index that this pandas method created.  There's a pandas method called wide_to_long that works similarly, but can be a little easier to use. Give it a try using xyzcust or the DataFrame of your choice.

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.wide_to_long.html

So at this point we've pivoted, grouped, and reshaped.  The pivoting example we did was pretty simple.  pandas also provides a method called pivot_table that provides considerable flexibility in terms of how data can be reorganized and summarized.  Let's consider the xyzcustnew data once again.  Suppose we want to average YTD_SALES_2009 by BUYER_STATUS, CHANNEL_ACQUISITION, and heavyCAT.  WE could do:

In [71]:
pd.pivot_table(xyzcustnew,values='YTD_SALES_2009',index=['BUYER_STATUS','heavyCat'],columns=['CHANNEL_ACQUISITION'])

CHANNEL_ACQUISITION             CB           IB           RT
BUYER_STATUS heavyCat
ACTIVE       regular    205.334086   191.047662   167.993913
             heavy     2397.606742  1251.559033  1158.506165
INACTIVE     regular      0.000000     0.000000     0.000000
LAPSED       regular      0.000000     0.000000     0.000000

Do you see some rows in the result that only have zeros?  Why are they there?

Or, try doing:

In [72]:
pd.pivot_table(xyzcustnew,values='YTD_SALES_2009',index=['BUYER_STATUS'],columns=['heavyCat','CHANNEL_ACQUISITION'])

heavyCat                regular                                heavy  \
CHANNEL_ACQUISITION          CB          IB          RT           CB
BUYER_STATUS
ACTIVE               205.334086  191.047662  167.993913  2397.606742
INACTIVE               0.000000    0.000000    0.000000          NaN
LAPSED                 0.000000    0.000000    0.000000          NaN

heavyCat
CHANNEL_ACQUISITION           IB           RT
BUYER_STATUS
ACTIVE               1251.559033  1158.506165
INACTIVE                     NaN          NaN
LAPSED                       NaN          NaN

Why are there NaN's?

pivot_table defaults to taking the mean (using np.mean) of the groups it defines.  If you want some other aggregation instead, you can define it as a keyword parameter, e.g. aggfunc=np.sum:   ******

In [73]:
pd.pivot_table(xyzcustnew,values='YTD_SALES_2009',index=['BUYER_STATUS'],columns=['heavyCat','CHANNEL_ACQUISITION'],aggfunc=np.sum)

heavyCat             regular                          heavy            \
CHANNEL_ACQUISITION       CB        IB         RT        CB        IB
BUYER_STATUS
ACTIVE               90963.0  212445.0  1241979.0  853548.0  879846.0
INACTIVE                 0.0       0.0        0.0       NaN       NaN
LAPSED                   0.0       0.0        0.0       NaN       NaN

heavyCat
CHANNEL_ACQUISITION         RT
BUYER_STATUS
ACTIVE               3852033.0
INACTIVE                   NaN
LAPSED                     NaN

You can also add margins to pivot_tables by using the margins=True option.  For example, to get row and column totals:

In [74]:
pd.pivot_table(xyzcustnew,values='YTD_SALES_2009',index=['BUYER_STATUS'],columns=['heavyCat','CHANNEL_ACQUISITION'],aggfunc=np.sum,margins=True)

heavyCat             regular                          heavy            \
CHANNEL_ACQUISITION       CB        IB         RT        CB        IB
BUYER_STATUS
ACTIVE               90963.0  212445.0  1241979.0  853548.0  879846.0
INACTIVE                 0.0       0.0        0.0       NaN       NaN
LAPSED                   0.0       0.0        0.0       NaN       NaN
All                  90963.0  212445.0  1241979.0  853548.0  879846.0

heavyCat                              All
CHANNEL_ACQUISITION         RT
BUYER_STATUS
ACTIVE               3852033.0  7130814.0
INACTIVE                   NaN        0.0
LAPSED                     NaN        0.0
All                  3852033.0  7130814.0

Should give you the same table as above but with row and column totals added.

It has probably dawned on you that you can manipulate data objects in many different ways to group them and to apply descriptive statistics to them.   Let's group xyz customers using BUYER_STATUS and heavyCat:

In [75]:
xyzcustnew.head()

,index,ACCTNO,ZIP,ZIP4,LTD_SALES,LTD_TRANSACTIONS,YTD_SALES_2009,YTD_TRANSACTIONS_2009,CHANNEL_ACQUISITION,BUYER_STATUS,ZIP9_SUPERCODE,heavyCat,typeReg,typeHeavy
0,0,WDQQLLDQL,60084,5016,90.0,1,0.0,0,IB,INACTIVE,600845016,regular,1,0
1,1,WQWAYHYLA,60091,1750,4227.0,9,1263.0,3,RT,ACTIVE,600911750,heavy,0,1
2,2,GSHAPLHAW,60067,900,420.0,3,129.0,1,RT,ACTIVE,600670900,regular,1,0
3,3,PGGYDYWAD,60068,3838,6552.0,6,0.0,0,RT,INACTIVE,600683838,regular,1,0
4,4,LWPSGPLLS,60090,3932,189.0,3,72.0,1,RT,ACTIVE,600903932,regular,1,0

In [76]:
xyzGrouper=xyzcustnew.groupby(['BUYER_STATUS','heavyCat'])

groupby can apply conventional as well as custom functions to aggregated data.  For example:

In [77]:
xyzGrouper.agg({'YTD_SALES_2009': [np.mean, np.std],'LTD_SALES':[np.mean,np.std]})

                      YTD_SALES_2009                 LTD_SALES
                                mean          std         mean           std
BUYER_STATUS heavyCat
ACTIVE       regular      172.707532   107.584023  1001.845105   1466.075631
             heavy       1274.048130  5434.616517  4096.179745  34210.646330
INACTIVE     regular        0.000000     0.000000   568.014784    850.966479
LAPSED       regular        0.000000     0.000000   841.467329   1374.447756

calculates the mean and standard deviation of YTD_SALES_2009 and LTD_SALES for each of the groups defined in xyzGrouper.  Note the little dict with a couple of key/value pairs there in the curly brackets, the {}.

Try using a version of this command to get statistics for the columns YTD_TRANSACTIONS_2009 and LTD_TRANSACTIONS.  These are both count variables.  What descriptive statistics do you think are appropriate for summarizing them?

Note that you can apply custom functions to data aggregates.  Suppose we wanted to compute the coefficient of variation,,â€CV,â€ for data.  The CV is a standardized measure of dispersion, and is the ratio of the standard deviation to to the mean.  It's estimated by the ratio  of the estimates of these two statistics.  We could write our own function do do this:

In [78]:
def coefV(x):                       # a baby CV function that accepts a sequence
    return np.std(x)/np.mean(x)

This will work assuming that the mean and std numpy methods are available in this function's namespace, of course.  Note that our baby function doesn't do anything smart regarding missing values and other inconveniences, but it's good enough to demonstrate what we want, here.  What do you think it means if what it produces is negative?  How could that happen?
[if mean <0?]
We can apply this function to selected groups.  Here we apply it to customers grouped by BUYER_STATUS.  Let's first get a simpler DataFrame to fiddle with:

In [110]:
buyerStats=xyzcustnew[['BUYER_STATUS','LTD_SALES','LTD_TRANSACTIONS']]
buyerGrouper=buyerStats.groupby(['BUYER_STATUS'])
buyerGrouper.agg(coefV)

              LTD_SALES  LTD_TRANSACTIONS
BUYER_STATUS
ACTIVE         9.758480          1.153501
INACTIVE       1.498058          0.784441
LAPSED         1.633290          0.987139

Did you get a table of CV's?  

We could combine our own function or functions with existing functions and apply them on a group by group basis.  Let's play with a function that returns 5th and 95th percentiles of some data:

In [80]:
def ptiles(x):
    p5=np.percentile(x,5)
    p95=np.percentile(x,95)
    return p5, p95

There's our toy function.   coefV, it may break with â€œbadâ€ data.  (So, watch out.)

What kind of object does ptiles return?

[tuple]

Now, applying np.mean and ptiles:

In [81]:
buyerGrouper.agg([np.mean, ptiles])

                LTD_SALES                            LTD_TRANSACTIONS  \
                     mean                     ptiles             mean
BUYER_STATUS
ACTIVE        2019.364086  (81.0, 6544.349999999997)         6.935794
INACTIVE       568.014784             (60.0, 1776.0)         2.263895
LAPSED         841.467329             (63.0, 2904.0)         3.498280


                   ptiles
BUYER_STATUS
ACTIVE        (1.0, 20.0)
INACTIVE       (1.0, 6.0)
LAPSED         (1.0, 9.0)

What kind of object is the above command printing out for you?

[df]

You can select particular results from this, of course, e.g.:

In [103]:
buyerGrouper.agg([np.mean,ptiles]).loc['ACTIVE','LTD_SALES']

mean                        2019.36
ptiles    (81.0, 6544.349999999997)
Name: ACTIVE, dtype: object

As a quick little exercise to do on you own, write a tiny function that calculates the â€œinterquartile range,â€ or IQR, for data, and then apply it to the above data.  The IQR is the difference between the 75th and the 25th percentile values.

Well, that wraps it up for this, and last, Python Practice.  No surprisingly, there's a lot more to data management using Python and packages like Pandas, and there's something new all the time. 

If you're an R user, and you use it on Linux or OS X, you'll want to check out the package rpy2, which provides some capability for transferring data between R and Python.  It's under development, and the plan is that it will eventually allow doing things like calling R functions from within Python.  It is apparently pretty tough to install and use from in Windows at the present time.

# Requirements :
1. Get the trDFgrouped data starting from the May heavy day counts to the August heavy counts
2. Group xyz customers using BUYER_STATUS, heavyCat, and ZIP, and apply np.sum function on the aggregated data for YTD_SALES_2009 and LTD_SALES columns

1. Get the trDFgrouped data starting from the May heavy day counts to the August heavy counts

In [85]:
# Write your python code that meets the above requirements in this cell
trDFgrouped[(5, 'heavy'):(8,'heavy')]

# your comment and code above are inconsistent in your version. mine above are corrected.  here's your original:
# "The data starting from the March heavy day counts to the July light counts:"
# "trDFgrouped[(3,'light'):(7,'heavy')]"

             transactions
monum vol
5     heavy          2172
      light          2076
6     heavy          2878
      light          1495
7     heavy          4440
      light           564
8     heavy          1682

2. Group xyz customers using BUYER_STATUS, heavyCat, and ZIP, and apply np.sum function on the aggregated data for YTD_SALES_2009 and LTD_SALES columns

In [121]:
xyzcustnew[['YTD_SALES_2009','LTD_SALES','BUYER_STATUS', 'heavyCat','ZIP']].groupby(['BUYER_STATUS', 'heavyCat','ZIP']).agg([np.sum])

                            YTD_SALES_2009  LTD_SALES
                                       sum        sum
BUYER_STATUS heavyCat ZIP
ACTIVE       regular  60056        68913.0   332196.0
                      60060        68520.0   339567.0
                      60061        68328.0   400569.0
                      60062       141237.0   762387.0
                      60064         2169.0     9129.0
                      60065         1002.0     2784.0
                      60067       156429.0   922680.0
                      60068       140133.0   802815.0
                      60069        43623.0   280686.0
                      60070        24051.0   134265.0
                      60071         4311.0    20112.0
                      60072         2037.0    14583.0
                      60073        29877.0   143901.0
                      60074        72999.0   349026.0
                      60076        53040.0   252438.0
                      60077        39546.0   183588.0
                      60078         1878.0     7410.0
                      60081        16446.0    76662.0
                      60083        14445.0    81954.0
                      60084        39834.0   243837.0
                      60085        18714.0    88857.0
                      60087        13749.0    59997.0
                      60088         1053.0     2538.0
                      60089       100038.0   481086.0
                      60090        32934.0   153108.0
                      60091       178533.0  1127982.0
                      60093       169671.0  1449606.0
                      60094          357.0      543.0
                      60096         5544.0    34929.0
                      60097         5805.0    29565.0
...                                    ...        ...
LAPSED       regular  60064            0.0     3537.0
                      60065            0.0     7359.0
                      60067            0.0   682167.0
                      60068            0.0   571056.0
                      60069            0.0   134685.0
                      60070            0.0    75333.0
                      60071            0.0    11232.0
                      60072            0.0     2463.0
                      60073            0.0   100932.0
                      60074            0.0   245877.0
                      60076            0.0   207912.0
                      60077            0.0   135801.0
                      60078            0.0     4173.0
                      60079            0.0     2928.0
                      60081            0.0    50397.0
                      60082            0.0      225.0
                      60083            0.0    71463.0
                      60084            0.0   157020.0
                      60085            0.0    60144.0
                      60087            0.0    45030.0
                      60088            0.0     3354.0
                      60089            0.0   407976.0
                      60090            0.0   137544.0
                      60091            0.0   820053.0
                      60093            0.0   955428.0
                      60095            0.0      300.0
                      60096            0.0    17559.0
                      60097            0.0    30564.0
                      60098            0.0   149418.0
                      60192            0.0     4548.0

[132 rows x 2 columns]